In [2]:
## panda series
import pandas as pd
data=[1,2,3,4,5]
series =pd.Series(data)
print(series)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
data = {
    "a":1,
    "b":2,
    "c":3
}
dict_series = pd.Series(data)
print(dict_series)

a    1
b    2
c    3
dtype: int64

In [6]:
data=[10,20,30,40]
index=['a','b','c','d']
pd.Series(data, index=index)

a    10
b    20
c    30
d    40
dtype: int64

In [7]:
## data frame
data = {
    'Name' : ['Meherab', 'Saimon', 'Nancy'],
    'Age' : [26,29,22],
    'City' : ['Chittagong', 'Dhaka', 'Noakhali']
}

pd.DataFrame(data)

      Name  Age        City
0  Meherab   26  Chittagong
1   Saimon   29       Dhaka
2    Nancy   22    Noakhali

In [9]:
data = {
    'Name' : ['Meherab', 'Saimon', 'Nancy', 'Rahim', 'Ayesha', 'Tanvir', 'Nusrat', 'Imran', 'Farhana', 'Rafi'],
    'Age' : [26, 29, 22, 31, 24, 27, 23, 35, 28, 21],
    'City' : ['Chittagong', 'Dhaka', 'Noakhali', 'Dhaka', 'Sylhet', 'Chittagong', 'Rajshahi', 'Khulna', 'Barisal', 'Rangpur']
}

pd.DataFrame(data)

      Name  Age        City
0  Meherab   26  Chittagong
1   Saimon   29       Dhaka
2    Nancy   22    Noakhali
3    Rahim   31       Dhaka
4   Ayesha   24      Sylhet
5   Tanvir   27  Chittagong
6   Nusrat   23    Rajshahi
7    Imran   35      Khulna
8  Farhana   28     Barisal
9     Rafi   21     Rangpur

In [10]:
## creating data frame from list of dict
data = [
    {'Name':'Meherab', 'Age': 25, 'City':'Chittagong'},
    {'Name':'Junaiyet', 'Age': 22, 'City':'Dhaka'},
    {'Name':'Sakin', 'Age': 27, 'City':'Sylhet'},
    {'Name':'Nancy', 'Age': 29, 'City':'Rangpur'},
]

df = pd.DataFrame(data)
print(df)

       Name  Age        City
0   Meherab   25  Chittagong
1  Junaiyet   22       Dhaka
2     Sakin   27      Sylhet
3     Nancy   29     Rangpur

In [11]:
df=pd.read_csv('sales_data.csv')
df.head(5)

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North

In [12]:
df.tail(5)

          Date Category  Value   Product  Sales Region
45  2023-02-15        B   99.0  Product2  599.0   West
46  2023-02-16        B    6.0  Product1  938.0  South
47  2023-02-17        B   69.0  Product3  143.0   West
48  2023-02-18        C   65.0  Product3  182.0  North
49  2023-02-19        C   11.0  Product3  708.0  North

In [15]:
data = {
    'Name' : ['Meherab', 'Saimon', 'Nancy', 'Rahim', 'Ayesha', 'Tanvir', 'Nusrat', 'Imran', 'Farhana', 'Rafi'],
    'Age' : [26, 29, 22, 31, 24, 27, 23, 35, 28, 21],
    'City' : ['Chittagong', 'Dhaka', 'Noakhali', 'Dhaka', 'Sylhet', 'Chittagong', 'Rajshahi', 'Khulna', 'Barisal', 'Rangpur']
}

df=pd.DataFrame(data)
print(df)

      Name  Age        City
0  Meherab   26  Chittagong
1   Saimon   29       Dhaka
2    Nancy   22    Noakhali
3    Rahim   31       Dhaka
4   Ayesha   24      Sylhet
5   Tanvir   27  Chittagong
6   Nusrat   23    Rajshahi
7    Imran   35      Khulna
8  Farhana   28     Barisal
9     Rafi   21     Rangpur

In [16]:
df['Name']

0    Meherab
1     Saimon
2      Nancy
3      Rahim
4     Ayesha
5     Tanvir
6     Nusrat
7      Imran
8    Farhana
9       Rafi
Name: Name, dtype: str

In [18]:
df.loc[0]

Name       Meherab
Age             26
City    Chittagong
Name: 0, dtype: object

In [19]:
df.loc[2]

Name       Nancy
Age           22
City    Noakhali
Name: 2, dtype: object

In [20]:
df.iloc[0]

Name       Meherab
Age             26
City    Chittagong
Name: 0, dtype: object

In [24]:
df.at[1, 'Name']

'Saimon'

In [26]:
df.at[1,'Name']

'Saimon'

In [28]:
## data manipulation
df['Salary']=[50000, 60000, 70000, 80000,50000, 60000, 70000, 80000,30000,32222]
df

      Name  Age        City  Salary
0  Meherab   26  Chittagong   50000
1   Saimon   29       Dhaka   60000
2    Nancy   22    Noakhali   70000
3    Rahim   31       Dhaka   80000
4   Ayesha   24      Sylhet   50000
5   Tanvir   27  Chittagong   60000
6   Nusrat   23    Rajshahi   70000
7    Imran   35      Khulna   80000
8  Farhana   28     Barisal   30000
9     Rafi   21     Rangpur   32222

In [29]:
df['Age'] = df['Age']+1
df

      Name  Age        City  Salary
0  Meherab   27  Chittagong   50000
1   Saimon   30       Dhaka   60000
2    Nancy   23    Noakhali   70000
3    Rahim   32       Dhaka   80000
4   Ayesha   25      Sylhet   50000
5   Tanvir   28  Chittagong   60000
6   Nusrat   24    Rajshahi   70000
7    Imran   36      Khulna   80000
8  Farhana   29     Barisal   30000
9     Rafi   22     Rangpur   32222

In [30]:
print("Statistical Summary: ", df.describe())

Statistical Summary:               Age        Salary
count  10.000000     10.000000
mean   27.600000  58222.200000
std     4.351245  17763.919599
min    22.000000  30000.000000
25%    24.250000  50000.000000
50%    27.500000  60000.000000
75%    29.750000  70000.000000
max    36.000000  80000.000000

In [31]:
df.describe()

             Age        Salary
count  10.000000     10.000000
mean   27.600000  58222.200000
std     4.351245  17763.919599
min    22.000000  30000.000000
25%    24.250000  50000.000000
50%    27.500000  60000.000000
75%    29.750000  70000.000000
max    36.000000  80000.000000